{
  "title": "vizTool for wf-tdm v9.1",
  "subtitle": "v24.10.29 beta",
  "splash": {
    "title": "IMPORTANT: BETA VERSION",
    "textHtml": "<p>You are using the beta version of vizTool, which is still undergoing testing and has not yet been validated outside of the development environment.</p><p>User guides, a data dictionary, and additional resources will be available on our GitHub <a href=\"https://github.com/WFRCAnalytics/vizTool/wiki\" target=\"_blank\">vizTool Wiki</a>. If you have any general feedback, bug reports, or suggestions, please submit them via the <a href=\"https://github.com/WFRCAnalytics/vizTool/issues\" target=\"_blank\">GitHub issues page</a>.</p><p>For urgent assistance or troubleshooting, please reach out to <a href=\"mailto:bhereth@wfrc.org\">Bill Hereth</a>.</p>\n<button id=\"okButton\">Continue</button>",
    "on": true
  },
  "checkboxesSelector": {
    "numOptionsForCheckAllButton": 4,
    "textCheckAll": "Check All",
    "textUncheckAll": "Uncheck All"
  },
  "onOpen": {
    "menuItem": "Roads and Transit",
    "modelEntity": "Road Segments",
    "centerMap": {
      "lat": 40.7707,
      "lon": -111.8926
    },
    "zoomMap": 10
  },
  "trendsDefaults":{
    "PLANAREA": "WFRC",
    "DISTSUPER": "6"
  },
  "menuItems": [
    { "menuText": "Roads and Transit",
      "menuIconStart": "driving-distance",
      "modelEntities": [
        { "submenuText": "Road Segments",
          "submenuIconStart": "line-straight",
          "template": "vizMap",
          "templateSettings": {
            "jsonName": "j-roadway-segments",
            "baseGeoJsonKey": "segment",
            "baseGeoJsonId": "SEGID",
            "geometryType": "polyline",
            "popupTitle": "Roadway Segments",
            "attributeTitle": "Roadway Segment Attributes",
            "attributeInfoTextHtml": "<b>Lanes</b> is the number of cross-section lanes.<br/><b>Area Type</b> represents the relative density of surrounding development for on which freeflow speeds are based.<br/><b>Functional Type</b> is the type of roadway on which capacity is based.<br/><b>Lane Hourly Capacity</b> is the maximum number of vehicles that can pass through a single lane per hour.<br/><b>Total Capacity</b> is the capacity for the entire period, which equals the number of lanes on the segment multiplied by the duration of the time period and the per hour per lane capacity.<br/><b>Free-flow Speed</b> is the speed vehicles can travel under ideal, congestion-free conditions as measured in mph.<br/><b>Volume</b> is the total number of vehicles using the segment.<br/><b>Truck Percent</b> is the percent of total volume that is trucks.<br/><b>Congested Speed</b> is the modeled travel speed accounting for traffic conditions.<br/><b>Maximum V/C Ratio</b> is the highest volume-to-capacity ratio modeled for the segment considering all functional groups, directions, and time periods.<br/><b>Directional Factor</b> is the portion of total segment volume that is traveling in a specified direction.<br/><b>Period Factor</b> is the ratio of period volume to daily volume.<br/><b>Functional Group Share</b> is the ratio of volume for functional group lanes to volume for all lanes.",
            "attributeSelected": "aLn",
            "attributes": ["aVl"],
            "filters" : ["fRoadSegFuncGroup","fTod4pDy","fVehType"]
          }
        }
      ]
    } 
  ]
}